Day55/projectsMaintenance/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @project =Project.all

INSERT INTO "projects" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "summa"], ["body", "summa "], ["created_at", "2020-09-18 09:44:03.589904"], ["updated_at", "2020-09-18 09:44:03.589904"]]
---
  def create
      # render plain: params[:project].inspect
      @project=  Project.new(project_params)
      if(@project.save)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "body" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["body", "summa edited"], ["updated_at", "2020-09-18 11:34:40.997511"], ["id", 1]]
---
  def update
    @project= Project.find(params[:id])
    if(@project.update(project_params))